src/test/resources/sample-soaps/propagerDonneesPointEtAffaire_HeadersKO.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://www.erdfdistribution.fr/tube/exposition/v2/entete" xmlns:v2="http://www.erdfdistribution.fr/tube/propagerdonneespointetaffaire/v2">
   <soapenv:Header>
      <ent:enteteLP soapenv:mustUnderstand="1">
         <!--Optional:-->
         <processusId>?</processusId>
         <infoFonctionnelles>
            <!--Optional:-->
            <affaireId>?</affaireId>
            <pointId>?</pointId>
            <!--Optional:-->
            <evenementNatureCode>?</evenementNatureCode>
         </infoFonctionnelles>
         <infoDemandeur>
            <codeDemandeur>?</codeDemandeur>
            <!--Optional:-->
            <appelDemandeurId>?</appelDemandeurId>
            <loginDemandeur>?</loginDemandeur>
         </infoDemandeur>
      </ent:enteteLP>
   </soapenv:Header>
   <soapenv:Body>
      <v2:propagerDonneesPointEtAffaire>
         <pointId>12345678911111</pointId>
         <demandeUtilisateur>true</demandeUtilisateur>
         <envoiAnticipe>true</envoiAnticipe>
      </v2:propagerDonneesPointEtAffaire>
   </soapenv:Body>
</soapenv:Envelope>